HarilDave/STM32_training_module/L_series_driver_common_for_test/Inc/spi_driver.h
/*
 * spi_driver.h
 *
 *  Created on: Oct 30, 2025
 *      Author: Himshree
 */

#ifndef SPI_DRIVER_H_
#define SPI_DRIVER_H_

#include "STM32_L0538xx.h"
#include <stdint.h>

/* SPI mode settings */
#define SPI_MODE_0   0  // CPOL=0, CPHA=0
#define SPI_MODE_1   1  // CPOL=0, CPHA=1
#define SPI_MODE_2   2  // CPOL=1, CPHA=0
#define SPI_MODE_3   3  // CPOL=1, CPHA=1

/* SPI device mode */
#define SPI_DEVICE_MODE_MASTER   1
#define SPI_DEVICE_MODE_SLAVE    0


/* =================== SPI Device Mode =================== */
#define SPI_MASTER_MODE   1
#define SPI_SLAVE_MODE    0



/* SPI baud rate control (fPCLK / x) */
#define SPI_SCLK_DIV2     0
#define SPI_SCLK_DIV4     1
#define SPI_SCLK_DIV8     2
#define SPI_SCLK_DIV16    3
#define SPI_SCLK_DIV32    4
#define SPI_SCLK_DIV64    5
#define SPI_SCLK_DIV128   6
#define SPI_SCLK_DIV256   7

/* SPI Data Frame Format */
#define SPI_DFF_8BIT   0
#define SPI_DFF_16BIT  1

/* SPI Bus Configurations */
#define SPI_BUS_FULL_DUPLEX   1
#define SPI_BUS_HALF_DUPLEX   2
#define SPI_BUS_SIMPLEX_RX    3

/* SPI NSS Management */
#define SPI_SSM_DISABLE   0
#define SPI_SSM_ENABLE    1

/* =================== SPI Clock Polarity (CPOL) =================== */
#define SPI_CPOL_LOW   0   // Clock idle state = 0
#define SPI_CPOL_HIGH  1   // Clock idle state = 1

/* =================== SPI Clock Phase (CPHA) =================== */
#define SPI_CPHA_LOW   0   // Clock idle state = 0
#define SPI_CPHA_HIGH  1   // Clock idle state = 1

/* =================== SPI Slave Management =================== */
#define SPI_SSM_HW   1   // Hardware slave management (NSS pin used)
#define SPI_SSM_SW   0   // Software slave management (NSS handled by software)

#define SPI_SSM_EN   1
#define SPI_SSM_DI   0

typedef struct
{
    uint8_t DeviceMode;         // Master/Slave
    uint8_t BusConfig;          // Full/Half/Simplex
    uint8_t SclkSpeed;          // Baud rate
    uint8_t DFF;                // 8/16-bit frame
    uint8_t CPOL;               // Clock polarity
    uint8_t CPHA;               // Clock phase
    uint8_t SSM;                // Software slave management
} SPI_Config_t;

typedef struct
{
    SPI_RegDef_t *pSPIx;
    SPI_Config_t  SPIConfig;
} SPI_Handle_t;

/* Peripheral Clock Control */
void SPI_PeriClockControl(SPI_RegDef_t *pSPIx, uint8_t EnOrDi);

/* Initialization & Control */
void SPI_Init(SPI_Handle_t *pSPIHandle);
void SPI_DeInit(SPI_RegDef_t *pSPIx);

void SPI_PeripheralControl(SPI_RegDef_t *pSPIx, uint8_t EnOrDi);
void SPI_ClockControl(SPI_RegDef_t *pSPIx, uint8_t EnOrDi);
void SPI_Enable(SPI_RegDef_t *pSPIx, uint8_t EnOrDi);
/* Data Send and Receive */
void SPI_SendData(SPI_RegDef_t *pSPIx, uint8_t *pTxBuffer, uint32_t Len);
void SPI_ReceiveData(SPI_RegDef_t *pSPIx, uint8_t *pRxBuffer, uint32_t Len);

/* Status Flag Check */
uint8_t SPI_GetFlagStatus(SPI_RegDef_t *pSPIx, uint32_t FlagName);

/* SPI Flag Macros */
#define SPI_TXE_FLAG   (1 << 1)
#define SPI_RXNE_FLAG  (1 << 0)
#define SPI_BSY_FLAG   (1 << 7)

void SPI_SSIConfig(SPI_RegDef_t *pSPIx, uint8_t EnOrDi);

#define SPI_CR1_SSI     8      // SSI bit position in CR1 register


void SPI_SendString(SPI_RegDef_t *pSPIx, char *pTxBuffer);
void SPI_ReceiveString(SPI_RegDef_t *pSPIx, char *pRxBuffer, uint32_t maxLen);

#endif /* SPI_DRIVER_H_ */
